# LandingHeightUnderStairsBottom Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..LandingHeightUnderStairsBottom Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Cannot make landing because height of landing is equal or less than to bottom height of the stair.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LandingHeightUnderStairsBottom { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LandingHeightUnderStairsBottom As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LandingHeightUnderStairsBottom {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace